Revit 2027 API
FormattedText.SetBoldStatus(Boolean) Method
 Sets the characters in the entire text to be bold or not bold.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBoldStatus(
	bool isBold
)
Public Sub SetBoldStatus (
	isBold As Boolean
)
public:
void SetBoldStatus(
	bool isBold
)
member SetBoldStatus :
        isBold : bool -> unit
Parameters
isBold Boolean
 The desired bold status of characters in the entire text. True to set bold, false to set not bold.
See Also
Reference
FormattedText Class
SetBoldStatus Overload
Autodesk.Revit.DB Namespace